In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("raw_data (1).csv")

In [3]:
df.shape

(2564680, 8)

In [4]:
df.head()

,id,gender,dob,income,marital_status,city,last_purchase_date,score
0,660ba2ad-e4ba-4e56-bc36-8a2daa77dd23,Male,1977-05-19,46532,Single,Oklahoma City,2020-06-22,63
1,6da25e92-ad6a-458b-a9b9-0995e664d229,Female,2000-11-28,13734,Single,Columbus,08-04-2020,43
2,11261389-dce2-4912-bd48-e406288f2a8b,Female,1975-06-05,36282,Single,Miami,2022-08-21,882
3,c9f67b5a-fcbf-4da0-bf31-c8d2492013ca,Male,27-05-1992,83451,Divorced,Colorado Springs,18-12-2020,653
4,d3024d83-cbd1-481a-8e29-a37259107dfb,Female,1987-09-13,58351,NaN,New Orleans,2021-05-25,535

In [5]:
df.isna().sum()

id                         0
gender                234849
dob                        0
income                     0
marital_status        285195
city                   51187
last_purchase_date         0
score                      0
dtype: int64

In [7]:
df.duplicated().sum()

2464680

In [10]:
df = df.drop_duplicates()

In [11]:
df

,id,gender,dob,income,marital_status,city,last_purchase_date,score
0,660ba2ad-e4ba-4e56-bc36-8a2daa77dd23,Male,1977-05-19,46532,Single,Oklahoma City,2020-06-22,63
1,6da25e92-ad6a-458b-a9b9-0995e664d229,Female,2000-11-28,13734,Single,Columbus,08-04-2020,43
2,11261389-dce2-4912-bd48-e406288f2a8b,Female,1975-06-05,36282,Single,Miami,2022-08-21,882
3,c9f67b5a-fcbf-4da0-bf31-c8d2492013ca,Male,27-05-1992,83451,Divorced,Colorado Springs,18-12-2020,653
4,d3024d83-cbd1-481a-8e29-a37259107dfb,Female,1987-09-13,58351,NaN,New Orleans,2021-05-25,535
...,...,...,...,...,...,...,...,...
861286,5716106a-8d4e-4e6f-9e84-d328747829b9,Female,1986-10-23,13986,Married,Las Vegas,07-11-2013,97
878293,cd28ebf2-7044-4a48-888f-3bf1b1d0c78e,Male,1976-10-12,69519,Divorced,Omaha,2011-08-03,1000
903223,59e2af4b-f282-4998-97f5-1bb70542633d,Female,05-04-1979,97057,Divorced,Tucson,04-01-2016,579
980974,4409db67-1df6-4080-b279-54740e79bceb,Male,1974-05-12,42351,NaN,Austin,2012-07-22,666
984525,ff4d610e-ced0-444c-bbb6-60086fea6f0f,Female,1994-10-23,69935,Single,Portland,2022-09-04,839

In [13]:
df.isna().sum()

id                        0
gender                 9150
dob                       0
income                    0
marital_status        11131
city                   2002
last_purchase_date        0
score                     0
dtype: int64

In [14]:
from scipy import stats

In [18]:
stats.mode(df.gender)

ModeResult(mode=array(['Male'], dtype=object), count=array([45587]))

In [20]:
df.gender=df.gender.fillna('Male')

In [23]:
df.gender.isna().sum()

0

In [24]:
stats.mode(df.marital_status)

ModeResult(mode=array(['Divorced'], dtype=object), count=array([22231]))

In [26]:
df.marital_status = df.marital_status.fillna('Divorced')

In [29]:
df.marital_status.isna().sum()

0

In [30]:
stats.mode(df.city)

ModeResult(mode=array(['Baltimore'], dtype=object), count=array([2098]))

In [32]:
df.city = df.city.fillna('Baltimore')

In [33]:
df.city.isna().sum()

0

In [34]:
df.isna().sum()

id                    0
gender                0
dob                   0
income                0
marital_status        0
city                  0
last_purchase_date    0
score                 0
dtype: int64

In [37]:
# Calculate the percentiles
p33, p66 = df['income'].quantile([0.33, 0.66])

# Define the function to categorize income
def income_group(x):
    if x <= p33:
        return 'Low'
    elif x <= p66:
        return 'Medium'
    else:
        return 'High'

# Apply the function to create the income_group column
df['income_group'] = df['income'].apply(income_group)

# Print the first 5 rows of the updated dataset
df.head()

,id,gender,dob,income,marital_status,city,last_purchase_date,score,income_group
0,660ba2ad-e4ba-4e56-bc36-8a2daa77dd23,Male,1977-05-19,46532,Single,Oklahoma City,2020-06-22,63,Medium
1,6da25e92-ad6a-458b-a9b9-0995e664d229,Female,2000-11-28,13734,Single,Columbus,08-04-2020,43,Low
2,11261389-dce2-4912-bd48-e406288f2a8b,Female,1975-06-05,36282,Single,Miami,2022-08-21,882,Medium
3,c9f67b5a-fcbf-4da0-bf31-c8d2492013ca,Male,27-05-1992,83451,Divorced,Colorado Springs,18-12-2020,653,High
4,d3024d83-cbd1-481a-8e29-a37259107dfb,Female,1987-09-13,58351,Divorced,New Orleans,2021-05-25,535,Medium

In [39]:
# Calculate the percentiles
p33, p66 = df['score'].quantile([0.33, 0.66])

# Define the function to categorize score
def score_group(x):
    if x <= p33:
        return 'Poor'
    elif x <= p66:
        return 'Fair'
    else:
        return 'Good'

# Apply the function to create the score_group column
df['score_group'] = df['score'].apply(score_group)

# Print the first 5 rows of the updated dataset
df.head()

,id,gender,dob,income,marital_status,city,last_purchase_date,score,income_group,score_group
0,660ba2ad-e4ba-4e56-bc36-8a2daa77dd23,Male,1977-05-19,46532,Single,Oklahoma City,2020-06-22,63,Medium,Poor
1,6da25e92-ad6a-458b-a9b9-0995e664d229,Female,2000-11-28,13734,Single,Columbus,08-04-2020,43,Low,Poor
2,11261389-dce2-4912-bd48-e406288f2a8b,Female,1975-06-05,36282,Single,Miami,2022-08-21,882,Medium,Good
3,c9f67b5a-fcbf-4da0-bf31-c8d2492013ca,Male,27-05-1992,83451,Divorced,Colorado Springs,18-12-2020,653,High,Fair
4,d3024d83-cbd1-481a-8e29-a37259107dfb,Female,1987-09-13,58351,Divorced,New Orleans,2021-05-25,535,Medium,Fair

In [40]:
# Convert last_purchase_date to datetime format
df['last_purchase_date'] = pd.to_datetime(df['last_purchase_date'])

# Filter out rows where last_purchase_date is before 2019
df = df[df['last_purchase_date'].dt.year >= 2019]

In [41]:
df

,id,gender,dob,income,marital_status,city,last_purchase_date,score,income_group,score_group
0,660ba2ad-e4ba-4e56-bc36-8a2daa77dd23,Male,1977-05-19,46532,Single,Oklahoma City,2020-06-22,63,Medium,Poor
1,6da25e92-ad6a-458b-a9b9-0995e664d229,Female,2000-11-28,13734,Single,Columbus,2020-08-04,43,Low,Poor
2,11261389-dce2-4912-bd48-e406288f2a8b,Female,1975-06-05,36282,Single,Miami,2022-08-21,882,Medium,Good
3,c9f67b5a-fcbf-4da0-bf31-c8d2492013ca,Male,27-05-1992,83451,Divorced,Colorado Springs,2020-12-18,653,High,Fair
4,d3024d83-cbd1-481a-8e29-a37259107dfb,Female,1987-09-13,58351,Divorced,New Orleans,2021-05-25,535,Medium,Fair
...,...,...,...,...,...,...,...,...,...,...
768670,3362e8f4-149e-4419-bba2-5314757ee067,Male,02-03-1986,95681,Divorced,Oklahoma City,2019-03-08,763,High,Good
776513,c545c90f-2ae6-4f32-9ed3-f91ecd3c79f1,Male,04-03-1978,71123,Widowed,El Paso,2020-09-03,198,High,Poor
790824,948606d1-e20e-4f9a-b945-2f010bdc3dca,Male,21-11-2000,90608,Single,Dallas,2019-01-03,674,High,Good
815434,55fc0c01-ef0f-4678-8a93-02a985109e2c,Male,1989-03-11,57674,Divorced,Indianapolis,2019-11-21,131,Medium,Poor
984525,ff4d610e-ced0-444c-bbb6-60086fea6f0f,Female,1994-10-23,69935,Single,Portland,2022-09-04,839,High,Good